# SQL Practice contd.

In [1]:
import sqlite3

In [2]:
# creating a db connection
conn = sqlite3.connect('db.sqlite3')

In [3]:
cur = conn.cursor()

In [4]:
create = """
CREATE TABLE IF NOT EXISTS USER(
    ID INTEGER PRIMARY KEY AUTOINCREMENT,
    NAME STRING NOT NULL,
    ADDRESS STRING NOT NULL,
    AGE INTEGER NULL,
    GENDER STRING NULL
);
"""
cur.execute(create)

In [5]:
read = 'SELECT * FROM USER;' # SELECTING EVERYTHING FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[]

In [6]:
update = """
INSERT INTO USER('NAME', 'ADDRESS', 'AGE')
VALUES('Ghana Shyam', 'Bhaktapur', 60);
"""
cur.execute(update)

In [7]:
read = 'SELECT * FROM USER;' # SELECTING EVERYTHING FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[(1, 'Ghana Shyam', 'Bhaktapur', 60, None)]

In [8]:
update = """
INSERT INTO USER('NAME', 'ADDRESS', 'AGE', 'GENDER')
VALUES('Radh Piyari', 'Bhaktapur', 50, 'F');
"""
cur.execute(update)

In [9]:
read = 'SELECT * FROM USER;' # SELECTING EVERYTHING FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[(1, 'Ghana Shyam', 'Bhaktapur', 60, None),
 (2, 'Radh Piyari', 'Bhaktapur', 50, 'F')]

In [10]:
update = """
INSERT INTO USER('NAME', 'ADDRESS', 'AGE', 'GENDER')
    VALUES('Rajesh Hamal', 'Kathmandu', 16, 'M'),
    ('Karishma Manandhar', 'Lalitpur', 14, 'F'),
    ('Bhuwan KC', 'Kathmandu', 50, 'M');
"""
cur.execute(update)

In [11]:
read = 'SELECT * FROM USER;' # SELECTING EVERYTHING FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[(1, 'Ghana Shyam', 'Bhaktapur', 60, None),
 (2, 'Radh Piyari', 'Bhaktapur', 50, 'F'),
 (3, 'Rajesh Hamal', 'Kathmandu', 16, 'M'),
 (4, 'Karishma Manandhar', 'Lalitpur', 14, 'F'),
 (5, 'Bhuwan KC', 'Kathmandu', 50, 'M')]

In [12]:
values = [
    ['Bruce Lee', 'USA', 40, 'M'],
    ['Kim Jong Un', 'North Korea', 35, 'M'],
    ['Alladhin', 'Wadiya', 30, 'M' ]
]

In [18]:
for val in values:
    update = f"""
    INSERT INTO USER('NAME', 'ADDRESS', 'AGE', 'GENDER')
    VALUES('{val[0]}', '{val[1]}', {val[2]}, '{val[3]}');
    """
    cur.execute(update)

In [19]:
read = 'SELECT * FROM USER;' # SELECTING EVERYTHING FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[(1, 'Ghana Shyam', 'Bhaktapur', 60, None),
 (2, 'Radh Piyari', 'Bhaktapur', 50, 'F'),
 (3, 'Rajesh Hamal', 'Kathmandu', 16, 'M'),
 (4, 'Karishma Manandhar', 'Lalitpur', 14, 'F'),
 (5, 'Bhuwan KC', 'Kathmandu', 50, 'M'),
 (6, 'Bruce Lee', 'USA', 40, 'M'),
 (7, 'Kim Jong Un', 'North Korea', 35, 'M'),
 (8, 'Alladhin', 'Wadiya', 30, 'M')]

In [20]:
read = 'SELECT NAME, ADDRESS, AGE FROM USER;' # SELECTING selected  columns FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[('Ghana Shyam', 'Bhaktapur', 60),
 ('Radh Piyari', 'Bhaktapur', 50),
 ('Rajesh Hamal', 'Kathmandu', 16),
 ('Karishma Manandhar', 'Lalitpur', 14),
 ('Bhuwan KC', 'Kathmandu', 50),
 ('Bruce Lee', 'USA', 40),
 ('Kim Jong Un', 'North Korea', 35),
 ('Alladhin', 'Wadiya', 30)]

In [21]:
read = 'SELECT NAME, ADDRESS, AGE, id FROM USER;' # SELECTING selected  columns FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[('Ghana Shyam', 'Bhaktapur', 60, 1),
 ('Radh Piyari', 'Bhaktapur', 50, 2),
 ('Rajesh Hamal', 'Kathmandu', 16, 3),
 ('Karishma Manandhar', 'Lalitpur', 14, 4),
 ('Bhuwan KC', 'Kathmandu', 50, 5),
 ('Bruce Lee', 'USA', 40, 6),
 ('Kim Jong Un', 'North Korea', 35, 7),
 ('Alladhin', 'Wadiya', 30, 8)]

In [22]:
read = 'SELECT NAME, ADDRESS, AGE FROM USER where age > 30;' # SELECTING selected  columns FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[('Ghana Shyam', 'Bhaktapur', 60),
 ('Radh Piyari', 'Bhaktapur', 50),
 ('Bhuwan KC', 'Kathmandu', 50),
 ('Bruce Lee', 'USA', 40),
 ('Kim Jong Un', 'North Korea', 35)]

In [24]:
read = "SELECT NAME, ADDRESS, AGE FROM USER where address = 'kathmandu'; " # SELECTING selected  columns FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[]

In [25]:
read = "SELECT NAME, ADDRESS, AGE FROM USER where address = 'Kathmandu'; " # SELECTING selected  columns FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[('Rajesh Hamal', 'Kathmandu', 16), ('Bhuwan KC', 'Kathmandu', 50)]

In [26]:
delete = 'DELETE FROM USER WHERE ID=8;'
cur.execute(delete)

In [27]:
read = 'SELECT * FROM USER;' # SELECTING EVERYTHING FROM USER TABLE
data = cur.execute(read)
data.fetchall()

[(1, 'Ghana Shyam', 'Bhaktapur', 60, None),
 (2, 'Radh Piyari', 'Bhaktapur', 50, 'F'),
 (3, 'Rajesh Hamal', 'Kathmandu', 16, 'M'),
 (4, 'Karishma Manandhar', 'Lalitpur', 14, 'F'),
 (5, 'Bhuwan KC', 'Kathmandu', 50, 'M'),
 (6, 'Bruce Lee', 'USA', 40, 'M'),
 (7, 'Kim Jong Un', 'North Korea', 35, 'M')]

In [28]:
conn.close()

# File Handling

```python
file = open('file_name', mode)
```

File handling mode
* **w**: Write into files, also overrites the contents
* **r**: Read files
* **a**: Append into files, will not overwite existing data
* **w+**: write and read data, will overwrite existing data
* **r+**: read and write data, will overwrite existing data
* **a+**: append and read data, will not overwite existing data

In [31]:
file = open('file.txt', 'r+')

In [32]:
message = '''
Hello form the other side.
I should have called you thousand times.
you tell you I am sorry.
'''

In [33]:
file.write(message)

94

In [34]:
file.close()

In [37]:
import numpy

In [38]:
# !pip install pandas==1.5.3

In [39]:
numpy.__version__

'1.25.1'

In [41]:
import pandas

In [42]:
pandas.__version__

'2.0.3'

In [43]:
!pip cache purge

Files removed: 10